---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSchemaSettingForSystemTemplate
source: html/e330b56d-a9b0-5c1a-dbbb-bcb630f179bb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSchemaSettingForSystemTemplate Property

"System Color Schemes"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSchemaSettingForSystemTemplate { get; }
```